In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('data/automobiles.csv')
df.head()

,mpg,cyl,displ,hp,weight,accel,yr,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,1,ford torino

In [3]:
df['name'].str.upper()

0              CHEVROLET CHEVELLE MALIBU
1                      BUICK SKYLARK 320
2                     PLYMOUTH SATELLITE
3                          AMC REBEL SST
4                            FORD TORINO
5                       FORD GALAXIE 500
6                       CHEVROLET IMPALA
7                      PLYMOUTH FURY III
8                       PONTIAC CATALINA
9                     AMC AMBASSADOR DPL
10                   DODGE CHALLENGER SE
11                    PLYMOUTH 'CUDA 340
12                 CHEVROLET MONTE CARLO
13               BUICK ESTATE WAGON (SW)
14                 TOYOTA CORONA MARK II
15                       PLYMOUTH DUSTER
16                            AMC HORNET
17                         FORD MAVERICK
18                          DATSUN PL510
19          VOLKSWAGEN 1131 DELUXE SEDAN
20                           PEUGEOT 504
21                           AUDI 100 LS
22                              SAAB 99E
23                              BMW 2002
24                           AMC GREMLIN
25                             FORD F250
26                             CHEVY C20
27                            DODGE D200
28                          DATSUN PL510
29                   CHEVROLET VEGA 2300
                     ...
167                        PONTIAC ASTRO
168                        TOYOTA CORONA
169                    VOLKSWAGEN DASHER
170                           DATSUN 710
171                           FORD PINTO
172                    VOLKSWAGEN RABBIT
173                            AMC PACER
174                           AUDI 100LS
175                          PEUGEOT 504
176                          VOLVO 244DL
177                            SAAB 99LE
178                     HONDA CIVIC CVCC
179                             FIAT 131
180                            OPEL 1900
181                             CAPRI II
182                           DODGE COLT
183                         RENAULT 12TL
184    CHEVROLET CHEVELLE MALIBU CLASSIC
185               DODGE CORONET BROUGHAM
186                          AMC MATADOR
187                     FORD GRAN TORINO
188                     PLYMOUTH VALIANT
189                       CHEVROLET NOVA
190                        FORD MAVERICK
191                           AMC HORNET
192                   CHEVROLET CHEVETTE
193                      CHEVROLET WOODY
194                            VW RABBIT
195                          HONDA CIVIC
196                       DODGE ASPEN SE
Name: name, dtype: object

In [6]:
df['name'].str.contains('plymouth')

0      False
1      False
2       True
3      False
4      False
5      False
6      False
7       True
8      False
9      False
10     False
11      True
12     False
13     False
14     False
15      True
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
167    False
168    False
169    False
170    False
171    False
172    False
173    False
174    False
175    False
176    False
177    False
178    False
179    False
180    False
181    False
182    False
183    False
184    False
185    False
186    False
187    False
188     True
189    False
190    False
191    False
192    False
193    False
194    False
195    False
196    False
Name: name, dtype: bool

In [7]:
df['name'].str.contains('plymouth').sum()

19